#####################################################
## День 4. Практика                                 #
#####################################################

# Задача 1

# Зум бросил вызов Флэшу и предложил ему честный поединок в виде гонки вокруг магнетара. В случае проигрыша эта нейтронная 
# звезда зарядится и уничтожит мир, поэтому Флэш решил не рисковать без причины и узнать у своего друга Циско Рамона, 
# есть ли смысл принимать вызов. Циско получил данные, что скорость Зума равна n, а скорость Флэша равна k.
# Напишите программу, которая должна вывести ответ Циско на вопрос Флэша.


n = int(input("Введите скорость Зума: "))
k = int(input("Введите скорость Флэша: "))

if n > k: 
    print("NO")
elif k > n:
    print("YES")
elif n == k:
    print("Don't know")
    
    
